Simulaciones/MEXICO/Simulations-Feb27/V0_2.1s/system/fvSchemes_URANS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//  default                        backward;
    default                        CrankNicholson 1.0;
}

gradSchemes
{
    default                        Gauss linear;
    grad(U)                        Gauss linear;
}

divSchemes
{
    default                        Gauss linear;
    div(phi,U)                     Gauss linear;
    div(phi,T)                     Gauss linear;
    div(R)                         Gauss linear;
    div(U)                         Gauss linear;
    div((nuEff*dev(grad(U).T())))  Gauss linear;
    div(B)                         Gauss linear;
    div(phi,B)                     Gauss linear;
}

laplacianSchemes
{
    default                        Gauss linear uncorrected;
    laplacian(rUA,p)               Gauss linear uncorrected;
    laplacian((1|A(U)),p)          Gauss linear uncorrected;
    laplacian(interpolate((1|A(U))),p) Gauss linear uncorrected;
    laplacian(interpolate((1|A(U))),pd) Gauss linear uncorrected;
    laplacian(nu,U)                Gauss linear uncorrected;
    laplacian(nuEff,U)             Gauss linear uncorrected;
    laplacian(kappaEff,T)          Gauss linear uncorrected;
    laplacian(DBEff,B)             Gauss linear uncorrected;
    laplacian(nuSgs,U)             Gauss linear uncorrected;
}

interpolationSchemes
{
    default                        linear;
}

snGradSchemes
{
    default                        uncorrected;
}

fluxRequired
{
    default                        no;
    pd                               ;
}

// ************************************************************************* //
